app/controllers/pages_controller.rb

  def home

    following = Array.new
    for @f in current_user.following do
      following.push(@f.id)
    end
    @posts = Post.where("user_id IN (?)", following)
---
SELECT "posts".* FROM "posts" WHERE (user_id IN (NULL))  ORDER BY "posts"."created_at" DESC

  def portfolio
    #grab the username as the URL :id
    if (User.find_by_username(params[:id]))
      @username = params[:id]
    else
      #redirect to error message (root for now)
      redirect_to root_path, :notice=> "User not found!"
    end

    @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)

    @newPost = Post.new

    @toFollow = User.all.last(5)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "clauds"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 6)  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 5
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

  def collections
    @posts = Post.all
    @newPost = Post.new
    @toFollow = User.all.last(5)
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 5